# -*- coding: utf-8 -*-

# [nan '昆山地税局' '吴中地税局' '昆山市地方税务局' '苏州市地方税务局' '苏州市国家税务局' '常熟地税局' '太仓市国家税务局'
#  '太仓市地方税务局' '苏州市地方税务局吴江区分局' '苏州市地方税务局吴中区分局' '苏州市地方税务局相城区分局' '太仓地税局'
#  '相城地税局' '苏州地税局第四税务分局' '苏州工业园区地方税务局' '江宁地税局' '张家港地税局' '常熟市地方税务局'
#  '天津市北辰区国家税务局' '昆山国税局' '北京市地方税务局' '上海市杨浦区国家税务局' '上海市青浦区国家税务局'
#  '上海市徐汇区国家税务局' '苏州工业园区地税局' '长沙市天心区国家税务局城南路税务分局' '深圳市国家税务局']


def tax_organization_value(text):
    if text.find('地税局') != -1 or text.find('地方税务局') != -1:
        return 1
    if text.find('国税局') != -1 or text.find('国家税务局') != -1:
        return 2
    return 3


# ['增值税' '10112|城镇土地使用税' '个人所得税' '城市维护建设税' '印花税' '城镇土地使用税' '企业所得税' nan
#  '教育费附加' '地方教育附加' '10111|印花税' '10109|城市维护建设税' '房产税' '10106|个人所得税'
#  '10110|房产税' '城建税' '营业税' '10104|企业所得税' '30216|地方教育附加' '30203|教育费附加'
#  '土地增值税' '10113|土地增值税' '10103|营业税' '增值税增值税']

def tax_type_value(text):
    if text.find('增值税') != -1:
        return 1
    if text.find('土地使用税') != -1:
        return 2
    if text.find('所得税') != -1:
        return 3
    if text.find('建设税') != -1 or text.find('城建税') != -1:
        return 4
    if text.find('印花税') != -1:
        return 5
    if text.find('教育费附加') != -1 or text.find('教育附加') != -1:
        return 6
    if text.find('房产税') != -1:
        return 7
    if text.find('营业税') != -1:
        return 8
    return 0
